Revit 2024 API
BuiltInFailures.StairRampFailures.MultusegmentRampRiser Property
 Ramp can't have multisegment Riser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MultusegmentRampRiser { get; }
Visual Basic
Public Shared ReadOnly Property MultusegmentRampRiser As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MultusegmentRampRiser {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace